{
	"1942-01-01": [
		{
			"title": "Allied Nations Sign Declaration",
			"event": "New Year's Day: Leaders of 26 Allied nations, including the United States, the United Kingdom, and the Soviet Union, sign the Declaration of the United Nations, pledging to continue the fight against the Axis powers."
		}
	],
	"1942-01-02": [
		{
			"title": "Japanese Forces Capture Manila",
			"event": "The Philippine capital falls as Japanese troops advance swiftly through the Pacific, tightening their grip on Southeast Asia."
		}
	],
	"1942-01-07": [
		{
			"title": "Bataan Campaign Begins",
			"event": "American and Filipino forces make their stand against Japanese troops on the Bataan Peninsula, marking the start of a brutal struggle."
		}
	],
	"1942-01-11": [
		{
			"title": "Japanese Invade Dutch East Indies",
			"event": "Japan opens a new front, invading the oil-rich Dutch East Indies in a strategic move to secure resources for its war effort."
		}
	],
	"1942-01-13": [
		{
			"title": "German U-Boats Attack US Shipping",
			"event": "Operation Paukenschlag (Drumbeat) begins as German submarines attack American shipping vessels along the East Coast, bringing the war to American waters."
		}
	],
	"1942-01-20": [
		{
			"title": "Wannsee Conference Held",
			"event": "Nazi Officials Meet at Wannsee: High-ranking Nazi leaders convene in Berlin to coordinate what they call the 'Final Solution,' detailing plans for the systematic extermination of Europe's Jewish population."
		}
	],
	"1942-01-23": [
		{
			"title": "Allied Forces Secure New Guinea Airfield",
			"event": "In a bold move, Allied forces secure an airfield on New Guinea, providing a critical foothold for future operations in the Pacific."
		}
	],
	"1942-01-25": [
		{
			"title": "Thailand Declares War on the Allies",
			"event": "Under Japanese influence, Thailand officially joins the Axis powers and declares war on the Allies."
		}
	],
	"1942-01-26": [
		{
			"title": "American Troops Land in Europe",
			"event": "First American Troops Arrive in Europe: U.S. forces land in Northern Ireland, marking the first deployment of American troops in Europe since the United States entered the war."
		}
	],
	"1942-01-29": [
		{
			"title": "Rosie the Riveter Campaign Launched",
			"event": "The U.S. government unveils 'Rosie the Riveter' to inspire American women to join the workforce and support the war effort from home."
		}
	],
	"1942-01-31": [
		{
			"title": "Battle for Singapore Intensifies",
			"event": "Japanese forces press their assault on Singapore, with British defenders preparing for what could become one of the most significant battles in the Pacific."
		}
	]
}